Tekla Open API Reference for Tekla Structures 2025
ClashCheckData Class
 The ClashCheckData class presents information about the detected clash. It is instantiated inside the onClashDetected method. The objects store the identifiers and type of the clash to be passed on to event subscribers.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.ClashCheckData
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ClashCheckData
<SerializableAttribute>
Public Class ClashCheckData
The ClashCheckData type exposes the following members.
Constructors
Name | Description
ClashCheckData
Initializes a new instance of the ClashCheckData class
Top
Properties
Name | Description
Object1
 Gets the first clashing object.
Object2
 Gets the second clashing object.
Overlap
 Gets the overlap of the clash. Only applies to clashes of type CLASH_TYPE_CLASH.
Type
 Gets the type of the clash.
Top
See Also
Reference
Tekla.Structures.Model Namespace